<template>
    <n-card title="三国演义" hoverable>
        <n-h6>
            词曰：滚滚长江东逝水，浪花淘尽英雄。是非成败转头空。青山依旧在，几度夕阳红。白发渔樵江渚上，惯看秋月春风。一壶浊酒喜相逢。古今多少事，都付笑谈中。——调寄《临江仙》话说天下大势，分久必合，合久必分。周末七国分争，并入于秦。及秦灭之后，楚、汉分争，又并入于汉。汉朝自高祖斩白蛇而起义，一统天下，后来光武中兴，传至献帝，遂分为三国。
        </n-h6>
    </n-card>
    <n-card title="红楼梦" hoverable>
        <n-h6>
            此开卷第一回也。作者自云：因曾历过一番梦幻之后，故将真事隐去，而借“通灵”之说，撰此《石头记》一书也。……原来女娲氏炼石补天之时，于大荒山无稽崖练成高经十二丈，方经二十四丈顽石三万六千五百零一块。娲皇氏只用了三万六千五百块，只单单剩了一块未用，便弃在此山青埂峰下。谁知此石自经煅炼之后，灵性已通，因见众石俱得补天，独自己无材不堪入选，遂自怨自叹，日夜悲号惭愧。……后因曹雪芹于悼红轩中披阅十载，增删五次，纂成目录，分出章回，则题曰《金陵十二钗》。并题一绝云：满纸荒唐言，一把辛酸泪！都云作者痴，谁解其中味？
        </n-h6>
    </n-card>
    <n-card title="水浒传" hoverable>
        <n-h6>
            词曰：试看书林隐处，几多俊逸儒流。虚名薄利不关愁，裁冰及剪雪，谈笑看吴钩。评议前王并后帝，分真伪，占据中州，七雄扰扰乱春秋。兴亡如脆柳，身世类虚舟。见成名无数，图形无数，更有那逃名无数。霎时新月下长川，江湖变桑田古路。讶求鱼缘木，拟穷猿择木，恐伤弓远之曲木。不如且覆掌中杯，再听取新声曲度。诗曰：纷纷五代乱离间，一旦云开复见天。草木百年新雨露，车书万里旧江山。寻常巷陌陈罗绮，几处楼台奏管弦。人乐太平无事日，莺花无限日高眠。话说这八句诗，乃是故宋神宗天子朝中一个名儒，姓邵，讳尧夫，道号康节先生所作。为叹五代残唐天下干戈不息，那时朝属梁，暮属晋。正谓是：“朱李石刘郭，梁唐晋汉周，都来十五帝，播乱五十秋。”后来感得天道循环，向甲马营中生太祖武德皇帝来。这朝圣人出世，红光满天，异香经宿不散，乃是上界霹雳大仙下降。英雄勇猛，智量宽洪，自古帝王都不及这朝天子。一条杆棒等身齐，打四百座军州都姓赵。
        </n-h6>
    </n-card>
    <n-card title="西游记" hoverable>
        <n-h6>
            诗曰：混沌未分天地乱，茫茫渺渺无人见。自从盘古破鸿蒙，开辟从兹清浊辨。覆载群生仰至仁，发明万物皆成善。欲知造化会元功，须看西游释厄传。盖闻天地之数，有十二万九千六百岁为一元。将一元分为十二会，乃子、丑、寅、卯、辰、巳、午、未、申、酉、戌、亥之十二支也。每会该一万八百岁。且就一日而论：子时得阳气，而丑则鸡鸣；寅不通光，而卯则日出；辰时食后，而巳则挨排；日午天中，而未则西蹉；申时晡而日落酉；戌黄昏而人定亥。譬于大数，若到戌会之终，则天地昏蒙而万物否矣。
        </n-h6>
    </n-card>

  </template>
  
  <style scoped>
  .n-card {
    max-width: 240px;
    float: left;

  }
  .n-h6{
    margin: auto;
  }
  </style>

<script setup>
import Picture from '@/Layout/Picture.vue';
import { storeToRefs } from 'pinia';
import { useComStore } from '@/store/comStore';
const comStore=useComStore();
const {com} =storeToRefs(comStore);
onBeforeMount(()=>{
    com.value=Picture
})
</script>

