<template>
  <n-card title="曹雪芹" :bordered="false" size="huge" hoverable>
    <p>曹雪芹（约1715年5月28日—约1763年2月12日） [1]  ，名霑，字梦阮，号雪芹，又号芹溪、芹圃，中国古典名著《红楼梦》的作者，祖籍存在争议（辽宁辽阳、河北丰润或辽宁铁岭 [2]  ），出生于江宁（今南京），曹雪芹出身清代内务府正白旗包衣世家，他是江宁织造曹寅之孙 [1]  ，曹顒之子（一说曹頫之子） [3]  。</p>
<p>曹雪芹早年在南京江宁织造府亲历了一段锦衣纨绔、富贵风流的生活 [4]  。曾祖父曹玺任江宁织造；曾祖母孙氏做过康熙帝的保母；祖父曹寅做过康熙帝的伴读和御前侍卫，后任江宁织造，兼任两淮巡盐监察御使，极受康熙宠幸。雍正六年（1728年），曹家因亏空获罪被抄家，曹雪芹随家人迁回北京老宅。后又移居北京西郊，靠卖字画和朋友救济为生 [1]  。曹家从此一蹶不振，日渐衰微。经历了生活中的重大转折，曹雪芹深感世态炎凉，对封建社会有了更清醒、更深刻的认识。他蔑视权贵，远离官场，过着贫困如洗的艰难日子。曹雪芹素性放达，爱好广泛，对金石、诗书、绘画、园林、中医、织补、工艺、饮食等均有所研究。他以坚韧不拔的毅力，历经多年艰辛，终于创作出极具思想性、艺术性的伟大作品——《红楼梦》。曹雪芹移居北京西郊后，生活更加穷苦，“满径蓬蒿”，“举家食粥酒常赊”。</p>
<p>乾隆二十七年（1762年），幼子夭亡，他陷于过度的忧伤和悲痛，卧床不起。乾隆二十八年（1763年）除夕（2月12日），因贫病无医而逝。关于曹雪芹逝世的年份，另有乾隆二十九年除夕（1764年2月1日）、甲申（1764年）初春之说。</p>

</n-card>
</template>

<style scoped>
.n-card {
  max-width: 500px;
}
</style>


