<template>
        <div>
        <n-h1>红楼梦</n-h1>
        <p>京都贾家是显赫的贵族，有荣国府、宁国府两座府邸。黛玉住进荣国府后，外祖母贾母疼爱她，与表兄贾宝玉相处得也十分亲密，晚上住在一起，白天也一道玩耍，过后不久，从金陵来了一封信，说黛玉舅母王夫人的同胞妹妹薛姨妈的儿子打死了人，应天府正在审理。但没过几天，薛姨妈却带着儿子和女儿薛宝钗进了荣国府。原来应天府知府是贾雨村，他见薛家是皇商，又与贾府有亲，便徇私枉法，不再追究凶手。</p>

        <p>薛宝钗比贾宝玉年长一些，有一只能同宝玉的通灵玉配对的金锁。她到贾府后处处随分从时，不像黛玉孤僻自傲，所以很快就得到了贾府上下的喜欢。黛玉对此很苦恼，常与宝玉发生口角，暗中伤心落泪。</p>

        <p>宝玉被送到家塾读书。父亲贾政只准宝玉背诵《四书》，要求十分严格。宝玉惧怕父亲，就像老鼠躲避猫儿一样。但贾母却非常娇惯孙儿，把宝玉看作是自己的心肝。</p>

        <p>过了几月，林如海身染重病，黛玉被送回了家。黛玉去后不久，宁国府贾珍的儿媳秦可卿死去。荣国府的管家少奶奶王熙凤被请去协助管理宁国府。在送殡的那天，王熙凤住在馒头庵，庵中老尼求王熙凤办理一件退婚案，为了图别人3000两银子，王熙凤派人去打通长安节度使的关节，竟活活拆散了一对美满姻缘，断送了两条人命。</p>
        <p>宁府丧事办完之后，林黛玉因父亲去世，无所依靠，又被接回了贾府。不久，被选入宫的贾政之女贾元春被加封贤德妃，皇帝特许贾府建造省亲别院。于是贾府在荣、宁二府之间丈量出三里半的地面，开始修建省亲别院，历时半年多建成，耗费了大量银钱，单采买戏子和服装道具一项就花银3万。次年正月十五，元春回家省亲，赐省亲别院名为“大观园”，对园内房舍也赐了名称，并叫宝玉和众姐妹搬进大观园，宝玉住怡红院，黛玉住潇湘馆，宝钗住蘅芜院，探春住秋掩书斋……宝玉在园内同众姐妹、丫环相处，倒也自在。</p>
        三月的一天，宝玉和王熙凤突然疯了。贾政的小老婆赵姨娘劝贾母快为二人准备后事，被贾母痛骂了一顿。原来这是赵姨娘为争夺家私、地位而请马道婆作的魇魔法术。幸亏来了一个癞和尚和一个跛道人，他们拿着通灵玉念念有词，才把宝玉和王熙凤救了回来。过了一个多月，宝玉一天去看黛玉，听黛玉随口吟出了《西厢记》的唱词。宝玉进屋，也念了两句《西厢记》的唱词同丫环开玩笑：“若共你多情小姐同鸳帐，怎舍得叫你叠被铺床。”黛玉一听便变了脸，哭着出门，说要去告诉舅父。宝玉慌了，急得赌咒发誓。次日是芒种节，黛玉桃林葬花，她由落花想到自己凄苦的命运，口吟《葬花词》。不料躲在桃林后的宝玉听了竟大哭起来。黛玉见是宝玉，抽身就走。宝玉叫住黛玉，说到：“你我从小一快儿长大，本该和气，为什么把宝姐姐、凤姐姐放在心里，不理我呢？”黛玉见宝玉一片痴情，心中很是感动。
端午节前，元春从宫里送来赏赐众姐妹的礼物，独独宝玉、宝钗的礼物相同。黛玉见此，很不高兴地说：“我没福气接受这礼物，比不得宝姑娘什么金啦玉的，我们不过是草木人儿罢了。”宝玉一听，申辩说：“我心里除了老太太、父亲、母亲，第四个就是你了。”黛玉说：“你心里有妹妹，只是见了姐姐就把妹妹忘了。”过了两天，宝玉和黛玉又发生口角，急得宝玉取了通灵玉来乱砸，黛玉也气得呕吐不止。直到第二天，宝玉去向黛玉陪了礼，两人才言归于好。这天中午，宝玉来到母亲王夫人住处，见丫头金钏儿在旁为母亲捶腿。宝玉以为母亲睡着了，就同金钏儿开玩笑，谁知母亲翻身而起，就给金钏儿以个嘴巴，并叫人把金钏儿赶出贾府。金钏儿满含冤屈，竟投井而死。过了两天，与贾府不和的忠顺府派人来找贾政，说宝玉勾引走了他们府中的戏子，请贾府交出。贾政大怒。这时赵姨娘所生儿子贾环又乘机进谗，说宝玉强奸金钏儿未遂，逼死了人命，贾政一听怒不可遏，以流荡优伶、淫辱母婢，将宝玉叫来，往死里乱打。贾母闻讯赶到，痛骂贾政，众人才将宝玉抬回房中。黛玉得知消息，慌忙赶去看望宝玉。宝玉见黛玉满脸泪痕，安慰她说：“我叫疼是装的，别信真了。”晚上，宝玉叫丫环送旧帕两条给黛玉。黛玉悟出了旧帕的意思，感到可喜、可悲、可惧、可愧，在帕上题了三首七绝，越加视宝玉为知己。
宝玉挨打后，宝钗也天天去探望宝玉，并劝宝玉读书上进。宝玉一听就生气，说：“好好一个清净洁白女子，也学得沽名钓誉，入了国贼蠹鬼之流。”宝钗听了，自觉没趣，只好离开。一天，宝玉正睡午觉，宝钗又去看宝玉。见丫头正给宝玉绣鸳鸯戏莲花样的肚兜，宝钗赞叹花样很好，拿过来帮助刺绣。这时，只听宝玉在梦中嚷道：“什么金玉姻缘！我偏说是木石姻缘！”宝钗听见不觉怔了，坐了一会，只好懒懒地离去。
宝玉身体复原后，在大观园中与众姐妹起海棠诗社，混迹在女儿圈内，做一个“富贵闲人”，更把立身扬名抛到了脑后。
大观园外，贾府上下安富尊荣，荒淫享乐，但经济状况已大不如前。在荣国府，王熙凤扣住小姐、丫环的月钱不发，用来放高利贷；王熙凤的公公贾赦看上贾母的丫头鸳鸯，打定主意要弄来作妾，被贾母骂了一顿；而元春的千两赏银以及其他收入已不够开支，王熙凤买通鸳鸯偷贾母的东西去当银子来贴补费用。在宁国府，年底黑山村来交租，折银2500两。贾珍说：“估计该交5000两，竟少了一半；我们共有八九个庄子，而今有两个庄子报了旱涝，真叫人别过年了！”
春节过后，王熙凤早产，一个多月不能理事。王夫人只好叫探春理家，并请宝钗协助。转眼过了几个月，宁国府贾珍之父贾敬在修道院中误吃丹药而死。贾珍妻子尤氏见无人料理宁府事务，将继母和两个妹妹尤二姐、尤三姐接到府中。王熙凤的丈夫贾琏见尤二姐漂亮温柔，在贾珍的撮合下，偷偷地同尤二姐结了婚。事隔不久，王熙凤知到了此事，将尤二姐哄入了荣国府，从精神上百般折磨，使尤二姐吞金而死。八月，有人在大观园拾到绣春囊，王夫人见到这个伤风败俗的东西，气得浑身发抖，命人查抄大观园各房，撵走了被认为“轻薄”的模样儿标致的丫头。宝玉见此，深感大观园不久将散，悲痛不已。
一年过后，贾母提起宝玉婚事，很夸奖宝钗温厚平和。王熙凤看贾母眼色行事，极力怂恿宝钗同宝玉成亲。黛玉得知风声，病情加重，决定绝食待毙。不久，宝玉的通灵玉丢失，黛玉暗自庆幸姻缘有望，病情好转，不再绝食。但宝玉失玉后却神志昏迷。年底，元春病逝宫内，贾府全家悲痛。过了春节，贾母、王夫人见宝玉痴呆难愈，决定娶宝钗为宝玉冲喜。王熙凤献掉包计，哄宝玉说是同黛玉成亲。宝玉成亲之日，黛玉病逝萧湘馆。过了几天，宝玉神志渐渐清醒，得知黛玉死音，心情非常悲愤。
宝玉婚后不久，御史以贾府作恶多端为由，弹劾贾府。同贾府有怨的锦衣府赵堂官带人查抄了宁国府。贾政也因为处事迂腐，用人不善，被朝廷降职。这时，依靠贾府而飞黄腾达的贾雨村反过来狠狠地踢了贾政一脚。贾府彻底衰败了。接着，贾母去世，王熙凤命丧黄泉，与贾府联络有亲的史、王、薛等家也一个个败落。最后，宝玉看破红尘，抛弃了家庭，丢下了宝钗，出家当了
    </div>
</template>


<script setup>

import { storeToRefs } from 'pinia';
import { useComStore } from '@/store/comStore'
import HLMAuthor from '@/components/HLMAuthor.vue';
const comStore=useComStore();
const { com } =storeToRefs(comStore);
onBeforeMount(()=>{
    com.value=HLMAuthor
})


</script>

<style scoped>

div{
    padding: 40px;
    background: url("@/static/hlmBack.jpg");
    background-size: cover;
    background-attachment: fixed;
}
p{
    font-size: 16px;
    text-indent:32px;
    
}
.n-h1{
    font-family: "楷书";
    color: #c93939;
    text-align: center;
}
</style>