<template>
    <div>
        <n-h1>水浒传</n-h1>
    <p>
 </p><p>       《水浒传》是一部产生于元末明初的长篇小说。它生动而深刻地描写和反映了北宋末年一支以宋江为领袖、有众多英雄豪杰参加的农民起义队伍的可歌可泣的事迹。
 </p><p>       这支队伍的参加者，绝大多数曾程度不同地遭受到封建统治阶级的各种各样的迫害。为了树起反抗的大旗，他们走到了一起，共同的目标把他们团结起来。他们开辟了根据地，建立军队。他们有严格的组织和严明的纪律。他们进行的是武装的斗争，而不是和平的、“合法的”斗争。他们的矛头所向，是地主恶霸，是贪官污吏，是封建官府，而不是某一特定的个人。
 </p><p>       《水浒传》着重剖析了农民起义的起因，它把王进和高俅的故事安排在正文的开端，紧接着叙述朱武、杨春、陈达被官司逼迫而上山落草，史进弃家逃亡的故事，然后又是鲁智深和镇关西郑屠的故事，林冲和高衙内、高俅的故事，这都不是偶然的。一方是压迫者，另一方是被压迫者，营垒分明。作者一开始就用艺术的手段触发了读者的爱憎，引导读者得出了结论：封建统治阶级是腐朽的、残暴的；乱由上作，官逼民反。在早先的《水浒传》的书名中，冠有“忠义”二字，这突出地体现了作者所要表达的重要思想。“义”是起义军团结的手段。作者提倡的一句话，“四海之内，皆兄弟也”，早已成为深入人心的处世格言。“忠”是梁山起义军所追求的另一个更大的目标。在起义军的决策者们（例如宋江、吴用等）的心目中，他们只反对朝廷和各级地方官僚机构中的奸臣、贪官污吏，而不反对皇帝。他们梦寐以求的，是尽忠报国，建功立业，封妻荫子，光宗耀祖。也就是说，对内惩贪官污吏，铲除奸臣，对外要立功于边陲。他们之所以会受朝廷的招安，原因即在于此。
 </p><p>     作者写农民起义，不满足于写农民起义的一两个片段、插曲，而是将农民起义的全过程，从发生、发展到衰败、瓦解，全都收入笔底。作者的创作意图在于，形象地表现和反映历史上的一场农民起义从首至尾的全过程，总结经验和教训，让人们深入地思考。
 </p><p>     如果说，《水浒传》是一篇农民起义的史诗，那么，应当更准确地说，它是一篇农民起义的悲壮的史诗。如果说，《水浒传》是一曲农民起义的颂歌，那么，应当更全面地说，它同时也是一曲农民起义的颂歌，那么，应当更全面地说，它同时也是一曲农民起义的挽歌。

    </p>
    </div>
</template>

<script setup>
import { storeToRefs } from 'pinia';
import { useComStore } from '@/store/comStore'
import SHZAuthor from '@/components/SHZAuthor.vue';
const comStore=useComStore();
const { com } =storeToRefs(comStore);
onBeforeMount(()=>{
    com.value=SHZAuthor
})

</script>
<style scoped>

div{
    padding: 40px;
    background: url("@/static/shzBack.jpg");
    background-size: cover;
    background-attachment: fixed;
}
p{
    font-size: 16px;
    text-indent:32px;
    
}
.n-h1{
    font-family: "楷书";
    color: #c93939;
    text-align: center;
}
</style>