<template>
    <div>
        <n-h1>西游记</n-h1>
        <p>
            东胜神洲傲来国海边有一花果山，山顶一石，受日月精华，产下一个石猴。石猴勇探瀑布飞泉，发现水帘洞，被众猴奉为“美猴王”。猴王领群猴在山中自由自在数百载，偶闻仙、佛、神圣三者可躲过轮回，与天地山川齐寿，遂独自乘筏泛海，历南赡部洲，至西牛贺洲，终在灵台方寸山斜月三星洞，为菩提祖师收留，赐其法名孙悟空。悟空在三星洞悟彻菩提妙理，学到七十二般变化和筋斗云之术后返回花果山，一举灭妖魔混世魔王，花果山狼、虫、虎、豹等七十二洞妖王都来奉其为尊。
</p><P>孙悟空占山为王，号为美猴王。苦于无兵刃，遂去东海龙宫求取，龙王及兄弟送他一支如意金箍棒及一身披挂。又与牛魔王、蛟魔王、鹏魔王、狮驼王、猕猴王、禺狨王等结为兄弟，日逐讲文论武，弦歌欢舞。一日被阴司按勾去，遂大闹幽冥，于生死上勾去所有猴属之名。龙王、地藏王上天庭告状，太白金星建议招安孙悟空，玉帝准奏。
</p><P>玉帝封孙悟空做“弼马温”，着他看管马匹。孙悟空后得知此官职卑微，大怒，打出南天门，回花果山，自封为“齐天大圣”，其他几个兄弟也分别自称了平天大圣、覆海大圣、混天大圣、移山大圣、通风大圣、驱神大圣。
</p><P>托塔天王李靖及哪吒三太子奉旨兴师捉拿孙悟空，被孙悟空打败，回天庭复旨。太白金星奏请玉帝降旨封孙悟空为齐天大圣，但不给他事务与俸禄。玉帝准奏。孙悟空应太白金星之邀，再入天宫。玉帝封其为齐天大圣，并赐予他齐天大圣府。孙悟空在天上无事，每日交朋结义，不论尊卑。玉帝怕他闲中生事，让其看管蟠桃园。王母举办蟠桃胜会，孙悟空怪王母未请其赶会，竟闯至会上，饱吃仙洒佳肴，又至兜率官，吃尽金丹；搅乱蟠桃会后，逃回花果山后，玉帝派十万天兵擒拿，未胜。
</p><P>观音菩萨推荐二郎神助战。悟空和二郎各显神通：多般变化，难分胜负；老君掷金钢琢打倒悟空，哮天犬咬住悟空方被擒。玉帝令天神将其处死，刀砍枪刺，雷击火燃，孙悟空却毫发无损。太上老君将其关入八卦炉，孙悟空不但不死，还炼就一双火眼金睛。四十九天后，悟空推翻八卦炉，舞金箍棒，乱天宫。诸天将不能敌，玉帝只得请来西天佛祖。如来法力无边，悟空无法跳出其手心，被压于五行山下，饮餐铁丸、渴饮铜汁度日。
</p><P>五百年后，如来因南赡部洲之人贪淫乐祸，多杀多争，令观音菩萨去东土觅一人，来西天取经，以普渡众生，并赐箍儿三个作降妖用。观世音菩萨携木叉行者往东土寻取经人，路上收服两个妖魔：一个原为灵霄殿下侍銮舆的卷帘大将，因失手打破玻璃盏，被玉帝贬在流沙河受苦；一个本是天河里的天蓬元帅，因带酒戏嫦娥，被打下凡尘投胎为猪形，在福陵山云栈洞为妖。观音替他们取法名沙悟净和猪悟能，叫他们等取经人来，保护取经人西去。观音又请玉帝饶怨犯法的西海龙王之子，将其送于深涧中，只等取经人来，为取经人作个脚力。
</p><P>行至五行山，被压在山下的孙悟空表示愿意悔过，观音也令其等唐国取经人来，“你可跟他做个徒弟，秉教伽持，入我佛门，再修正果”。
</p><P>唐太宗开科取士，青年陈光蕊高中状元，又娶相府殷小姐为妻。之后，官拜江州州主。陈光蕊携妻赴任，路上，被贼人刘洪谋害，妻子被占。陈之妻殷氏产下一子，抛入江中，被金山寺寺僧搭救。此子十八年后受戒，法名玄奘。玄奘终与母亲相见，又求见外祖父，报了血仇。
        </p>
    </div>
</template>
<script setup>
import XYJAuthor from '@/components/XYJAuthor.vue'
import { storeToRefs } from 'pinia';
import { useComStore } from '@/store/comStore';
const comStore=useComStore();
const {com} =storeToRefs(comStore);
onBeforeMount(()=>{
    com.value=XYJAuthor
})

</script>
<style scoped>

div{
    padding: 40px;
    background: url("@/static/xyjBack.webp");
    background-size: cover;
    background-attachment: fixed;
}
p{
    font-size: 16px;
    text-indent:32px;
    
}
.n-h1{
    font-family: "楷书";
    color: #c93939;
    text-align: center;
}
</style>