<template>
    <div>
        <h1>水浒传</h1>
        <p>《水浒传》是一部以描写古代农民起义为题材的长篇小说。它形象地描绘了农民起义从发生，发展直至失败的全过程，深刻揭示了起义的社会根源，满腔热情地歌颂了起义英雄的反抗斗争和他们的社会理想，也具体揭示了起义失败的内在历史原因。作品在思想内容和文学艺术上都取得了重大成就。</p>
        <p>该书在塑造人物形象方面积累了丰富的艺术经验。作品能紧紧扣住人物的不同出身经历，通过人物自己的语言和行动去表现其性格，如吴用的神机妙算，鲁智深的忠勇仗义，李逵的粗鲁莽撞，武松的神威神勇，林冲，花荣的骁勇善战，石秀的英雄孤胆，燕青的机智灵活，以及西门庆的骄横，蒋门神的凶悍，潘金莲的淫荡，都给人留下深刻的印象。作品同时也能够很准确地把握住人物性格与身份，社会地位，生活阅历之间的相互作用。比如说豹子头林冲，原本是东京八十万禁军枪棒教头，有着较优越的社会地位，同时又是习武带兵之人，具有丰富的作战经验，基于这一前提，作者赋予他的性格既有隐忍退让，委曲求全的一面，又有敢做敢为，骁勇善战的一面。在封建恶势力的逼迫下，林冲的身份，地位，生活发生了急剧变化，促成了他思想和性格的转化，从而作者成功地塑造了一个原来根本没有想到自己要造反而最后不得不造反的人物形象。</p>
        <p>小说的故事性很强，达到了极高的水平，这可能是受到说书话本的影响。主要表现在小说随处可见引人入胜的情节。如倒拔垂杨柳，智取生辰纲，风雪上神庙，大闹清风寨，景阳岗打虎，醉打蒋门神，三打祝家庄和攻陷大名府等等。《水浒传》还写了不少战争的场面，再现了起义军的战略战术，体现了辩证法思想，如三打祝家庄，大败高太尉等等。《水浒传》的影响巨大广泛，几百年来，其具有反抗意识，乐观精神和理想化的英雄一直为人民所乐道，鼓舞着被压迫者的反抗斗争。</p>
    </div>
</template>

<style scoped>
h1{
    font-family: "楷书";
    color: #242667;
    text-align: center;
}
p{
    font-size: 16px;
    text-indent:32px;
    
}

</style>