<template>
    <div>
        <h1>西游记</h1>
        <p>中国古典四大名著之一，是最优秀的神话小说，也是一部群众创作和文人创作相结合的作品。小说以整整七回的“大闹天宫”故事开始，把孙悟空的形象提到全书首要的地位。第八至十二回写如来说法，观音访僧，魏徵斩龙，唐僧出世等故事，交待取经的缘起。从十四回到全书结束，写孙悟空被迫皈依佛教，保护唐僧取经，在八戒、沙僧协助下，一路斩妖除魔，到西天成了“正果”。</p>
        <p>《西游记》主要描写的是孙悟空保唐僧西天取经，历经九九八十一难的故事。唐僧取经是历史上一件真实的事。大约距今一千三百多年前，即唐太宗贞观元年（627），年仅25岁的青年和尚玄奘离开京城长安，只身到天竺（印度）游学。他从长安出发后，途经中亚、阿富汗、巴基斯坦，历尽艰难险阻，最后到达了印度。他在那里学习了两年多，并在一次大型佛教经学辩论会任主讲，受到了赞誉。贞观十九年（645）玄奘回到了长安，带回佛经657部。他这次西天取经，前后十九年，行程几万里，是一次传奇式的万里长征，轰动一时。后来玄奘口述西行见闻，由弟子辩机辑录成《大唐西域记》十二卷。但这部书主要讲述了路上所见各国的历史、地理及交通，没有什么故事。及到他的弟子慧立、彦琮撰写的《大唐大慈恩寺三藏法师传》，则为玄奘的经历增添了许多神话色彩，从此，唐僧取经的故事便开始在民间广为流传。南宋有《大唐三藏取经诗话》，金代院本有《唐三藏》、《蟠桃会》等，元杂剧有吴昌龄的《唐三藏西天取经》、无名氏的《二郎神锁齐大圣》等，这些都为《西游记》的创作奠定了基础。吴承恩也正是在民间传说和话本、戏曲的基础上，经过艰苦的再创造，完成了这部令中华民族为之骄傲的伟大大文学巨著。</p>
        <p>吴承恩，字汝忠，号射阳山人，淮安府山阳（今江苏省淮安市）人。约生于明弘治十三年至正德初年之间（1500—1510），约卒于万历十年（1582）。吴承恩的曾祖父、祖父都是读书人，任过县学的训导、教谕。但到了他父亲吴锐这一辈，由于家贫困，出赘徐家，“遂袭徐氏业，坐肆中”，当起了小商人。尽管如此，吴家却不失读书的传统。据说其父吴锐虽为商人，不仅为人正派，而且好读书，好谈时政，这自然对吴承恩产生较大影响。吴承恩从小就很聪明，很早入了学，少年得志，名满乡里。天启《淮安府志》卷十六说吴承恩“性敏而多慧，博极群书，为诗文，下笔立成。”但成年后的吴承恩却很不顺利，在科举进身的道路上屡遭挫折，到四十多岁才补了一个岁贡生，五十多岁任过浙江长兴县丞，后又担任过荆王府纪善，这是同县丞级别差不多的闲职。吴承恩创作《西游记》大约是中年以后，或认为是晚年所作，具体时间无法确定。除《西游记》外，他还创作有长诗《二郎搜山图歌》和《禹鼎志》。现存《射阳先生存稿》四卷，包括诗一卷、散文三卷，是吴承恩逝世后由丘度编订而成。 </p>
        <p>《西游记》全书一百回，从大的结构上看，可分成三个部分。第一回至第八回是第一部分，主要写了孙悟空出世、拜师、大闹天宫，这是全书最精彩的章节，热闹非凡，孙悟空上天入地好一顿折腾，将他的反抗性格表现得淋漓尽致。第八回至第十二回是第二部分，主要写了唐僧的出身及取经的缘由。第十三回至最后一回是第三部分，主要写唐僧西天取经，路上先后收了孙悟空、猪八戒、沙和尚三个徒弟，并历经九九八十一难，终于取到了真经，修成了正果。 《西游记》向人们展示了一个绚丽多彩的神魔世界，人们无不在作者丰富而大胆的艺术想象面前惊叹不已。然而，任何一部文学作品都是一定社会生活的反映，作为神魔小说杰出代表的《西游记》亦不例外。正如鲁迅先生在《中国小说史略》中指出，《西游记》“讽刺揶揄则取当时世态，加以铺张描写”。又说：“作者禀性，‘复善谐剧’，故虽述变幻恍忽之事，亦每杂解颐之言，使神魔皆有人情，精魅亦通世故。”的确如此。 </p>
        <p>通过《西游记》中虚幻的神魔世界，我们处处可以看到现实社会的投影。如在孙悟空的形象创造上，就寄托了作者的理想。 孙悟空那种不屈不挠的斗争精神，奋起金箍棒，横扫一切妖魔鬼怪的大无畏气概，反映了人民的愿望和要求。他代表了一种正义的力量，表现出人民战胜一切困难的必胜信念。又如取经路上遇到的那些妖魔，或是自然灾难的幻化，或是邪恶势力的象征。他们的贪婪、凶残、阴险和狡诈，也正是封建社会里的黑暗势力的特点。不仅如此，玉皇大帝统治的天宫、如来佛祖管辖的西方极乐世界，也都浓浓地涂上了人间社会的色彩。而作者对封建社会最高统治者的态度也颇可玩味，在《西游记》中，简直找不出一个称职的皇帝；至于昏聩无能的玉皇大帝、宠信妖怪的车迟国国王、要将小儿心肝当药引子的比丘国国王，则不是昏君就是暴君。对这些形象的刻画，即使是信手拈来，也无不具有很强的现实意义。 《西游记》不仅有较深刻的思想内容，艺术上也取得了很高的成就。它以丰富奇特的艺术想象、生动曲折的故事情节，栩栩如生的人物形象，幽默诙谐的语言，构筑了一座独具特色的《西游记》艺术宫殿。但我认为，《西游记》在艺术上的最大成就，是成功地创造了孙悟空、猪八戒这两个不朽的艺术形象。 孙悟空是《西游记》中第一主人公，是个非常了不起的英雄。他有无穷的本领，天不怕地不怕，具有不屈的反抗精神。</p>
    </div>
</template>

<style scoped>
h1{
    font-family: "楷书";
    color: #a5ae00;
    text-align: center;
}
p{
    font-size: 16px;
    text-indent:32px;
}

</style>